In [2]:
import numpy as np
import pandas as pd

All of the important data directories

In [1]:
DATA_DIR = "../data/"
CALENDAR_PATH = DATA_DIR + "calendar.csv"
SAMPLE_SUBMISSION_PATH = DATA_DIR + "sample_submission.csv"
SELL_PRICES_PATH = DATA_DIR + "sell_prices.csv"
SALES_TRAIN_VALIDATION_PATH = DATA_DIR + "sales_train_validation.csv"

Loading the data into DataFrames

In [16]:
sell_prices_df = pd.read_csv(SELL_PRICES_PATH)
sales_train_val_df = pd.read_csv(SALES_TRAIN_VALIDATION_PATH)
calendar_df = pd.read_csv(CALENDAR_PATH)
sell_prices_df.shape, sales_train_val_df.shape

((6841121, 4), (30490, 1919))

In [4]:
sales_train_val_df.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1904,d_1905,d_1906,d_1907,d_1908,d_1909,d_1910,d_1911,d_1912,d_1913
0,HOBBIES_1_001_CA_1_validation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,3,0,1,1,1,3,0,1,1
1,HOBBIES_1_002_CA_1_validation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
2,HOBBIES_1_003_CA_1_validation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,1,2,1,1,1,0,1,1,1
3,HOBBIES_1_004_CA_1_validation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,0,5,4,1,0,1,3,7,2
4,HOBBIES_1_005_CA_1_validation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,1,1,0,1,1,2,2,2,4

In [10]:
object_columns = sales_train_val_df.select_dtypes('object')

print(object_columns)

                                  id        item_id    dept_id   cat_id  \
0      HOBBIES_1_001_CA_1_validation  HOBBIES_1_001  HOBBIES_1  HOBBIES
1      HOBBIES_1_002_CA_1_validation  HOBBIES_1_002  HOBBIES_1  HOBBIES
2      HOBBIES_1_003_CA_1_validation  HOBBIES_1_003  HOBBIES_1  HOBBIES
3      HOBBIES_1_004_CA_1_validation  HOBBIES_1_004  HOBBIES_1  HOBBIES
4      HOBBIES_1_005_CA_1_validation  HOBBIES_1_005  HOBBIES_1  HOBBIES
...                              ...            ...        ...      ...
30485    FOODS_3_823_WI_3_validation    FOODS_3_823    FOODS_3    FOODS
30486    FOODS_3_824_WI_3_validation    FOODS_3_824    FOODS_3    FOODS
30487    FOODS_3_825_WI_3_validation    FOODS_3_825    FOODS_3    FOODS
30488    FOODS_3_826_WI_3_validation    FOODS_3_826    FOODS_3    FOODS
30489    FOODS_3_827_WI_3_validation    FOODS_3_827    FOODS_3    FOODS

      store_id state_id
0         CA_1       CA
1         CA_1       CA
2         CA_1       CA
3         CA_1       CA
4         CA_1       CA
...        ...      ...
30485     WI_3       WI
30486     WI_3       WI
30487     WI_3       WI
30488     WI_3       WI
30489     WI_3       WI

[30490 rows x 6 columns]

In [15]:

pd.get_dummies(sales_train_val_df, columns=["cat_id","store_id","dept_id","state_id"], 
               prefix=["category","store","dept","state"]).head()

,id,item_id,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,...,dept_FOODS_1,dept_FOODS_2,dept_FOODS_3,dept_HOBBIES_1,dept_HOBBIES_2,dept_HOUSEHOLD_1,dept_HOUSEHOLD_2,state_CA,state_TX,state_WI
0,HOBBIES_1_001_CA_1_validation,HOBBIES_1_001,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,1,0,0
1,HOBBIES_1_002_CA_1_validation,HOBBIES_1_002,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,1,0,0
2,HOBBIES_1_003_CA_1_validation,HOBBIES_1_003,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,1,0,0
3,HOBBIES_1_004_CA_1_validation,HOBBIES_1_004,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,1,0,0
4,HOBBIES_1_005_CA_1_validation,HOBBIES_1_005,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,1,0,0

In [26]:
calendar_df.head()

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,2011-01-29,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
1,2011-01-30,11101,Sunday,2,1,2011,d_2,NaN,NaN,NaN,NaN,0,0,0
2,2011-01-31,11101,Monday,3,1,2011,d_3,NaN,NaN,NaN,NaN,0,0,0
3,2011-02-01,11101,Tuesday,4,2,2011,d_4,NaN,NaN,NaN,NaN,1,1,0
4,2011-02-02,11101,Wednesday,5,2,2011,d_5,NaN,NaN,NaN,NaN,1,0,1

In [18]:
sell_prices_df.head()

  store_id        item_id  wm_yr_wk  sell_price
0     CA_1  HOBBIES_1_001     11325        9.58
1     CA_1  HOBBIES_1_001     11326        9.58
2     CA_1  HOBBIES_1_001     11327        8.26
3     CA_1  HOBBIES_1_001     11328        8.26
4     CA_1  HOBBIES_1_001     11329        8.26

Checking out the dtypes - reducing the int64's to make it more memory efficient

In [25]:

calendar_df[["month", "snap_CA", "snap_TX", "snap_WI", "wday"]] = \
calendar_df[["month", "snap_CA", "snap_TX", "snap_WI", "wday"]].astype("int8")
calendar_df[["wm_yr_wk", "year"]] = calendar_df[["wm_yr_wk", "year"]].astype("int16") 
calendar_df["date"] = calendar_df["date"].astype("datetime64")
print(calendar_df.dtypes)

date            datetime64[ns]
wm_yr_wk                 int16
weekday                 object
wday                      int8
month                     int8
year                     int16
d                       object
event_name_1            object
event_type_1            object
event_name_2            object
event_type_2            object
snap_CA                   int8
snap_TX                   int8
snap_WI                   int8
dtype: object